### CSE-221710302060-Shaik Shoaib Aslam

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn

In [3]:
data = pd.read_table("http://bit.ly/movieusers")
data.head(10)

      1|24|M|technician|85711
0          2|53|F|other|94043
1         3|23|M|writer|32067
2     4|24|M|technician|43537
3          5|33|F|other|15213
4      6|42|M|executive|98101
5  7|57|M|administrator|91344
6  8|36|M|administrator|05201
7        9|29|M|student|01002
8        10|53|M|lawyer|90703
9         11|39|F|other|30329

In [4]:
data = pd.read_table("http://bit.ly/movieusers", sep = '|')
data.head(10)

    1  24  M     technician  85711
0   2  53  F          other  94043
1   3  23  M         writer  32067
2   4  24  M     technician  43537
3   5  33  F          other  15213
4   6  42  M      executive  98101
5   7  57  M  administrator  91344
6   8  36  M  administrator  05201
7   9  29  M        student  01002
8  10  53  M         lawyer  90703
9  11  39  F          other  30329

In [5]:
data = pd.read_table("http://bit.ly/movieusers",sep = '|',header = None)
data.head(10)

    0   1  2              3      4
0   1  24  M     technician  85711
1   2  53  F          other  94043
2   3  23  M         writer  32067
3   4  24  M     technician  43537
4   5  33  F          other  15213
5   6  42  M      executive  98101
6   7  57  M  administrator  91344
7   8  36  M  administrator  05201
8   9  29  M        student  01002
9  10  53  M         lawyer  90703

### Handling Missing Values

In [6]:
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [7]:
df.day.dtype

dtype('O')

In [8]:
type(df.day[0])

str

In [9]:
df['temperature'].value_counts()

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [13]:
# Checking for duplicates entire dataset
df[df.duplicated()]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [14]:
# Checking duplicates for specific column
df[df['temperature'].duplicated()]

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [15]:
df[df['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [16]:
# Converting date column to date format
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",parse_dates = ['day'])
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [17]:
df.day.dtype

dtype('<M8[ns]')

In [19]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [45]:
new_df = df.replace({"temperature": -99999 , "windspeed": -99999 , 'event': '0'},np.nan)
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

### Imputation : It is a process of substituting missing values

In [46]:
new_df.isna().sum()

day            0
temperature    2
windspeed      2
event          2
dtype: int64

In [47]:
df1 = new_df.fillna(0)
df1

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [55]:
f_data = new_df.fillna(method = 'ffill')
f_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [59]:
b_data = new_df.fillna(method = 'bfill')
b_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         28.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         32.0        7.0   Rain
4 2017-01-05         32.0        2.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [58]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [60]:
# Mean Imputation
mean_data = new_df.fillna(new_df.mean())  # fill missing values with mean value of the column
mean_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         31.4        7.0  Sunny
2 2017-01-03         28.0        5.4   Snow
3 2017-01-04         31.4        7.0    NaN
4 2017-01-05         32.0        5.4   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [61]:
# Median Imputation
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [63]:
median_data = new_df.fillna(new_df.median())
median_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        6.0   Snow
3 2017-01-04         32.0        7.0    NaN
4 2017-01-05         32.0        6.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [66]:
new_df.event.mode().iloc[0]

'Rain'

In [69]:
new_df['event'] = new_df['event'].fillna(new_df.event.mode().iloc[0])
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0   Rain
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0   Rain

### Problem Solving

In [77]:
arr1 = np.array([[19,7,19,93],
                [94,18,4,22],
                [5,21,95,17],
                [20,92,20,6]])

In [78]:
arr1.sum(axis = 1)

array([138, 138, 138, 138])

In [80]:
s = 0
for i in range(1,3):
    for j in range(1,3):
        s += arr1[i,j]
s

138

In [81]:
# for forward diagonal sum
arr1.trace(axis1 = 0,axis2 = 1)

138

In [83]:
# for backward diagonal sum
arr1.trace(axis1 = 1,axis2 = 0)

138

In [82]:
diagsum = 0
backdiag = 0
for i in range(4):
    for j in range(4):
        if i == j:
            diagsum += arr1[i,j]
        if i+j == 3:
            backdiag += arr1[i,j]
print(diagsum,backdiag)

138 138

In [84]:
# For first square
s = 0
for i in range(2):
    for j in range(2):
        s += arr1[i,j]
s

138